#21. Calculate the below operation.
3 ([
2 5
3 7
] âˆ’ [
5 10
15 20])



> mat1<-matrix(c(2,3,5,7),nrow=2,ncol=2)
> mat2<-matrix(c(5,15,10,20),nrow=2,ncol = 2)
> mat1
     [,1] [,2]
[1,]    2    5
[2,]    3    7
> mat2
     [,1] [,2]
[1,]    5   10
[2,]   15   20
> diff<-mat1-mat2
> diff
     [,1] [,2]
[1,]   -3   -5
[2,]  -12  -13
> result<-3*diff
> result
     [,1] [,2]
[1,]   -9  -15
[2,]  -36  -39
